{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day"],
         "responses": ["Hello, how can I help you today?"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye"],
         "responses": ["See you later, I hope I could help you", "Have a nice day", "Bye! I'm here to help anytime"]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },
        {"tag": "vegan food",
         "patterns": ["Do you have any vegan food?", "food without meat", "vegtarian vegan menu", "Do you have any vegetarian food", "Do you have vegetarian or vegan catering?","food", "catering","vegan","vegetarian" ],
         "responses": ["Yes, of course. We have vegan and vegetarian food on board. Take a look at our online menu or ask for it on board to the flight attendant"]
        },
        {"tag": "payments on board",
         "patterns": ["Can I pay the meals by credit card on board?", "paying on board", "food drinks meals menus credit card on board" ],
         "responses": ["Yes you can. You'll be able to pay by credit card or cash."]
        },
        {"tag": "checked baggage limitations",
         "patterns": ["What is my hand luggage allowed?", "hand luggage", "cabin luggage", "cabin bag allowance", "cabin baggage", "on board baggage", "checked baggage", "bag", "baggage weight", "baggage size", "baggage weight", "baggage size", "baggage limitations" ],
         "responses": ["You can take on board 1 piece of hand luggage up to a maximum weight of 10 kg, and a maximum size of 55x40x20 cm. You can also carry a smaller bag or case (max. 35x20x20), which must be stored under the seat in front."]
        },
        {"tag": "pets",
         "patterns": ["Can I bring my pet on the flight?", "pet", "animals", "fly with animals", "pet on board", "animal on board"],
         "responses": ["It is allowed to fly with your pet. It will travel with you on board the plane. Only one pet is allowed per person and a maximum of 2 pets per flights in the cabin of the plane; animals cannot be carried in the plane's cargo hold. Also, your pet must fly in an approved, non-rigid pet-carrier (not exceeding 45x39x21 cm and 8 kg with the pet inside). During the flight, your pet must travel on the floor, between your legs or under your seat. You can include a pet in the booking when you purchase the flight and see the fares for this service."]
        },
        {"tag": "lost baggage",
         "patterns": ["What do I do if my baggage is lost?", "my baggage is lost", "my luggage is lost", "lost", "missing", "missing luggage baggage", "lost luggage baggage", "claim luggage baggage bag", "baggage rights"],
         "responses": ["If you are at the airport and your bag has failed to appear on the luggage belt, follow these steps: 1. Go to the Lost and Found office located in the baggage collection area. 2. Report the incident in the Property Irregularity Report (P.I.R.) that you will be given there.  3. Once we have located your luggage, we will inform you via SMS or by phone, and we will send it to you at the address specified in the P.I.R. If you would like to specify a new delivery address, please advise us so we can update it. "]
        },
        {"tag": "cancelled flights",
         "patterns": ["How do I claim a cancelled flight?", ", rights or options if cancellation", "cancelled flight", "my cancellation rights", "which are my rights if my fligh is cancelled", "passenger cancellation rights", "my flight has been cancelled what do i do", "what happens if my flight is cancelled"],
         "responses": ["If your flight has been cancelled, please go to Manage your booking to see the alternatives that we can offer you. There you can manage changes directly or choose the alternatives available to you more quickly and easily. If you need to make a claim, or ask for compensation, you can do so directly via the Contact page on our website. Before initiating any procedure, check your passenger rights. In case of cancellation you have the following rights: 1. we can re-book you on another flight at the earliest opportunity, subject to availability of seats. 2. we can refund you the total fare paid for the cancelled flight. 3. Also a part from facilitate two phone calls, fax or e-mail, when the time of departure of the new flight is the day after the departure as it was planned for the cancelled flight arrange hotel accommodation and transport between the airport and place of accommodation free of charge. Also note that if your flight is cancelled for reasons attributable to us, you are entitled to receive, besides your passenger rights, a compensation calculated according to the length of the flight: Flights of less than 1500 km: 250 EUR. Flights of between 1500 and 3500 km: 400 EUR. Flights of more than 3500 km: 600 EUR. In the case of extraordinary circumstances, passengers are entitled to assistance at the airport and even hotel accommodation if the flight departs the following day."]
},
{"tag": "flight changes",
         "patterns": ["How can I change my flight?", "change flight", "change destination origin", "change booking travel"],
         "responses": ["You can change the date or time of your flight up to 2 hours before scheduled departure through our website or mobile app, or by calling our Customer Services Centre. You can also change it at the airport up to one hour before departure. Please note that the cost of this service is 30€."]
},
{"tag": "refund",
         "patterns": ["How can I request a refund", "refund", "refund situations", "when refund"],
         "responses": ["You can apply for a refund if:  1. Your flight was cancelled due to a flight disruption. 2. Your flight was changed by other airline due to a flight disruption. 3. Your flight was delayed 3 or more hours. 4. In case of cancellation, if we were unable to seat you in a suitable alternative seat. 5. In case of large delay or cancellation, you changed your flight/seat type and purchased a new seat. 6. Most refunds are done back to the same card you paid for your ticket and within two weeks time."]
},
{"tag": "delayed flights",
         "patterns": ["my flight has been delayed", "passenger rights of delayed flight", "rifhts or options if delay","delayed flight departure", "delay", "delay rights", "passenger dely rights"],
         "responses": ["Apologies if your flight has been delayed. In this case if the delay is morre that 2 hours but less than 5 hours you have the following rights: 1. refreshment and meal in a value that is proportionate to your delay. 2. two telephone calls, or telex, fax messages or e-mails. If your flight has been delayed more than 5 hours you have the following rights: 1. you can cancel your fligh reservation and we will reimburse the total fare of the cancelled flight at the price at which it was bought. 2. we can re-book you onto a return flight operated by us or another airline under comparable transport conditions to your first point of departure, at the earliest opportunity, subject to availability of seats. 3. if as a result of the long delay, the time of departure of the delayed flight is the day after the planned day of departure, we will arrange hotel accommodation and transport between the airport and place of accommodation free of charge. *In all situations if th delay is more than 3 hours you have also the right of claim a compensation."]
},
{"tag": "flight information",
         "patterns": ["where can i find information about the flight", "flight status", "status information"],
         "responses": ["You can see the status of your flight in real time in the Flight Status section in our official webpage, app or in the airports origin or destination webpage. Also, if there's a change, delay or cancellation of your flight, you will be previously informed by e-mail or via app or SMS."]
},
{"tag": "electronic devices",
         "patterns": ["Can I use electronic devices on board", "electronic devices", "tablets mobiles laptops gameboys games", "flight mode", "e-reader"],
         "responses": ["Yeah, I can't sleep on planes either. So sure you can bring your electronic devices like a laptop, tablet, phone, portable game device or e-reader. Please note that all electronic devices should be taken to the cabin. Just remember they have to be on flight mode from boarding to landing. "]
},
{"tag": "own food",
         "patterns": ["Can I bring my own food on board", "bring my home food", "bring food from home", "can i heat food on board", "use the micro onboard","food from home", "food not purchased onboard", "homemade food", "not purchased"],
         "responses": ["You may bring your own food on board if you follow the safety regulations. Please note that the food cannot be heated during the flight and also that you are not allowed to bring any liquids."]
},
{"tag": "smoking",
         "patterns": ["Can I use electronic cigarettes on board", "can i smoke on board", "smoking allow", "is it allowed to smoke on board"],
         "responses": ["No you can't. It is terminately prohibited to smoke onboard, even if it's an electronic cigarrete."]
},
{"tag": "seat size",
         "patterns": ["Which is the size of the seat", "is it the seat confortable", "seat size per fares", "seat measures", "are business seats so big?", "are economy seats very small", "distances between seats", "legs distance", "seat comfort"],
         "responses": ["Economy class seats are stantarized, so you'll have enough space for your legs to fit and also not disturb or be disturbed by your seat partners. Business class seats are bigger and more confortable, with more space for the legas and also wider, so you won't even notice if there's a flight partner because there's just 4 seats per row, not 6 seats as in Economy class. All of them are made by leather."]
},
        {"tag": "Ticket changes",
         "patterns": ["Can I change the name of my ticket?", "my name on the ticket is incorrect","change name", "name", "change","incorrect name", "how change my name" ],
         "responses": ["Name Changes:some of our fares allow you to change the name on the ticket for a fee. Click on Fare Rules to see if your ticket qualifies & fees.Name Corrections: If you have misspelt your name by mistake, or changed surname due to marriage or other, please contact us."]

},
{"tag": "Buy tickets",

         "patterns": ["Where can I buy the tickets?", "buy tickets", "tickets", "where", "buy online", "buy agency", "buy airline"],
 
         "responses": ["You can buy your flight tickets by different ways: 1- entering directly in our airline website. 2- buy it in an agency website. 3- Buy it personally in the big agency sales centers."]

},
{"tag": "Online check-in",

         "patterns": ["How can I do the check-in?","Is it possible to do the online check-in?", "Can I do the check-in with my phone?", "online check-in", "check-in online", "How to do the online check-in", "check-in."],
 
         "responses": ["Once you've completed your booking and depending on your fare selected, your online check-in could be Optima and Excellence Fares: Once you've completed your booking, you'll receive an email containing your boarding passes. Once you have them, don't forget to print them out, or download them on the airline app for smartphones. That way, you'll save time on the day of your flight because, if you don't have to check in any baggage, you can go straight to the boarding gate. In the case of connecting flights, you can also check in online. Basic Fare :You can check in online free of charge by requesting a random seat (subject to availability) between 7 days and 4 hours before your flight departs (except if you are flying from Cardiff, Lyon, Prague or London Heathrow, where you can only check in online up to 24 hours before departure). Most airports we fly to allow online check-in, but there are certain airports for which this service is not available (check whether the airport allows it.).]

},
{"tag": "Documentation",

         "patterns": ["What kind of documents do I need to flight?", "Documents to flight","flight documents","documents","documentation needed","which documents do I need?", "necessary documents".], 
         "responses": ["Normally, your valid ID document or passport will suffice. In any case, the rules may vary depending on your nationality and destination, so we recommend visiting our web page about Documentation where we explain all cases in detail."]

},
{"tag": "Drinks",

         "patterns": ["Is the water on board for free?","free drinks","on board drinks","the water is free?","water","drinks","drinks on board","catering drinks"],
 
         "responses": ["Coffee, tea, water and blueberry juice are served free of charge on all our flights."]

},
{"tag": "Child on board",

         "patterns": ["Can the children travel alone?", "child traveling alone", "child alone", "Do the children need to travel with someone?", "children flying"],
 
         "responses": [" Minors under 12 years of age cannot travel without a responsible companion over 16 years of age."]

},
{"tag": "Departure",

         "patterns": ["How long before departure do I have to be at the airport?", "how long do I have to wait before departure?", "time before departure", "departure time"],
 
         "responses": ["We recommend that you arrive at the airport in plenty of time. The check-in desks open 2 hours before departure and close 40 minutes before departure, except: For all flights from Rome (Fiumicino) and St. Petersburg, the check-in desks close 45 minutes before departure. For all flights from Tel Aviv, Beirut, Algiers and Oran, the check-in desks open 3 hours before departure and close 60 minutes before departure. If you're travelling from Paris (Orly) to Casablanca, the check-in desks close 60 minutes before departure. If you're travelling from Barcelona to Tel Aviv, the check-in desks close 60 minutes before departure. If you're travelling from Marrakech (RAK), the check-in desks close 60 minutes before departure."]

},
{"tag": "Overbooking",

         "patterns": ["what can I do if my flight is overbooked?","overbooked flight","my flight is overbooked","overbooking",],
 
         "responses": ["If you have been denied boarding without there being extraordinary circumstances or for reasons not attributable to the passenger, our ground staff will offer you free assistance at the airport consisting of: Tickets for meals and beverages. 2 phone calls (or other means of communication, such as email). If you have to wait overnight: accommodation, meals and transport between the airport and your accommodation"]

},
{"tag": "Reservation",

         "patterns": ["Can I change my reservations online after i check in?", "change my reservation", "reservations", "reservations after check in", "reservations online"],
 
         "responses": ["No. You can’t change your reservation online once you’ve checked in. Contact Reservations for assistance"]

},
{"tag": "Notifications",

         "patterns": ["What if I didn't get my notification?","notification problems","online notification","flight notification","notification"],
 
         "responses": ["If you have your confirmation code and didn't receive your notification, contact technical support"]

},
{"tag": "Special passengers",

         "patterns": ["What accomodations are available for costumers with a disability?","passanger with a disability","disability cares","disability seats"],
 
         "responses": ["Certain seats are made available to travelers with a disability. Please see our Seating Accommodations page for information about how to request special accommodations."]

},
{"tag": "Extra space",

         "patterns": ["I need extra space, do I need to purchase an additional seat?","space problem","more space needed","extra space","the space is not enough"],
 
         "responses": ["If you are not able to safely and comfortably fit in one seat with the armrests down for the entirety of the flight, please see our Customers Requiring Extra Seating page for information. You can also purchase an extra seat for a musical instrument or a fragile item. Please see our Cabin-seat Baggage page for more information."]

},
        {"tag": "rental",
         "patterns": [],
         "responses": ["Are you looking to rent today or later this week?"],
         "context_set": "rentalday"
        },
        {"tag": "today",
         "patterns": ["today"],
         "responses": ["For rentals today please call 1-800-MYMOPED", "Same-day rentals please call 1-800-MYMOPED"],
         "context_filter": "rentalday"
        }
   ]
}
